{
  "title": "About Our School",
  "description": "Discover the story, values, and vision that make AIC Sengani Girls High School a center of excellence in education.",
  "historyTitle": "Our History",
  "historyContent": "AIC Sengani Girls High School was established as part of the Africa Inland Church's commitment to providing quality education to young women in Kenya. Founded with a vision to empower girls through education, the school has grown from humble beginnings to become one of the respected educational institutions in Machakos County.\n\nLocated in the serene environment of Tala town in Matungulu Sub-County, the school has expanded over the years to accommodate its growing student population, which now stands at approximately 840-960 students. The school's development has been marked by continuous improvement in infrastructure, academic programs, and extracurricular offerings.",
  "missionTitle": "Our Mission",
  "missionContent": "To provide quality education that nurtures the intellectual, physical, social, and spiritual development of young women, empowering them to become responsible leaders and contributors to society.",
  "visionTitle": "Our Vision",
  "visionContent": "To be a center of excellence in holistic education, producing well-rounded individuals who can contribute positively to society and reach their full potential in all areas of life.",
  "valuesTitle": "Our Values",
  "valuesList": [
    {
      "name": "Excellence",
      "description": "We strive for the highest standards in all aspects of education and character development."
    },
    {
      "name": "Integrity",
      "description": "We uphold honesty, transparency, and ethical conduct in all our interactions."
    },
    {
      "name": "Respect",
      "description": "We value the dignity and worth of every individual in our community."
    },
    {
      "name": "Responsibility",
      "description": "We encourage accountability for one's actions and decisions."
    },
    {
      "name": "Service",
      "description": "We foster a spirit of giving back to the community and serving others."
    }
  ]
}
