{
  "title": "Academic Excellence",
  "description": "Discover our comprehensive curriculum designed to inspire and challenge our students to reach their full potential.",
  "curriculumTitle": "Curriculum Overview",
  "curriculumContent": "AIC Sengani Girls High School follows the Kenya Certificate of Secondary Education (KCSE) curriculum, providing a comprehensive education that prepares students for higher learning and future careers. Our academic program is designed to challenge students intellectually while fostering critical thinking, problem-solving, and creativity.\n\nOur dedicated team of qualified teachers employs modern teaching methodologies to ensure effective learning. We maintain small class sizes to allow for personalized attention and support for each student's unique learning needs.",
  "subjectAreasTitle": "Our Subject Areas",
  "subjectAreas": [
    {
      "name": "Mathematics",
      "description": "Building strong foundations in mathematical concepts and problem-solving skills.",
      "icon": "mathematics"
    },
    {
      "name": "Sciences",
      "description": "Exploring biology, chemistry, and physics through theoretical learning and practical laboratory work.",
      "icon": "sciences"
    },
    {
      "name": "Languages",
      "description": "Developing proficiency in English, Kiswahili, and optional foreign languages.",
      "icon": "languages"
    },
    {
      "name": "Humanities",
      "description": "Studying history, geography, religious education, and business studies.",
      "icon": "humanities"
    },
    {
      "name": "Technical Subjects",
      "description": "Offering computer studies, agriculture, and home science.",
      "icon": "technical"
    },
    {
      "name": "Creative Arts",
      "description": "Nurturing talent through music and visual arts education.",
      "icon": "arts"
    }
  ],
  "achievementTitle": "Academic Achievements",
  "achievementContent": "AIC Sengani Girls High School has consistently performed well in national examinations, with many of our students qualifying for admission to prestigious universities in Kenya and abroad. Our academic excellence is reflected in our KCSE results, which have shown improvement year after year.\n\nOur students also participate in various academic competitions at county and national levels, including science congresses, mathematics contests, and debate tournaments, where they have won numerous accolades."
}
