{
  "title": "Student Life",
  "description": "Life at AIC Sengani Girls High School extends beyond the classroom, offering a rich tapestry of experiences that develop the whole person.",
  "holisticTitle": "Holistic Development",
  "holisticContent": "At AIC Sengani Girls High School, we believe that education goes beyond academics. Our holistic approach to education aims to develop well-rounded individuals who excel not only in their studies but also in character, leadership, and various talents.\n\nThrough a balanced program of academic learning, sports, clubs, leadership opportunities, and spiritual guidance, we nurture the intellectual, physical, social, emotional, and spiritual aspects of our students' lives.",
  "sportsTitle": "Sports",
  "sportsContent": "Physical education is an integral part of our curriculum. We encourage all students to participate in sports for physical fitness, character building, and the development of teamwork and leadership skills. Our school has excellent sports facilities and qualified coaches who guide students in various sporting activities.",
  "sportsList": [
    {"name": "Basketball"},
    {"name": "Volleyball"},
    {"name": "Netball"},
    {"name": "Athletics"},
    {"name": "Football"},
    {"name": "Hockey"},
    {"name": "Tennis"},
    {"name": "Swimming"}
  ],
  "clubsTitle": "Clubs and Societies",
  "clubsList": [
    {
      "name": "Debate Club",
      "description": "Enhancing public speaking, critical thinking, and argumentation skills through regular debates and competitions.",
      "icon": "debate"
    },
    {
      "name": "Science Club",
      "description": "Exploring scientific concepts through experiments, projects, and participation in science congresses.",
      "icon": "science"
    },
    {
      "name": "Music and Drama Club",
      "description": "Nurturing talent in singing, instrumental music, dance, and drama through regular performances and competitions.",
      "icon": "music"
    },
    {
      "name": "Environmental Club",
      "description": "Promoting environmental awareness and conservation through tree planting, clean-ups, and educational campaigns.",
      "icon": "environment"
    },
    {
      "name": "Christian Union",
      "description": "Fostering spiritual growth through Bible study, prayer meetings, and community service.",
      "icon": "christian"
    },
    {
      "name": "Chess Club",
      "description": "Developing strategic thinking and concentration through regular chess practice and tournaments.",
      "icon": "chess"
    }
  ],
  "boardingTitle": "Boarding Life",
  "boardingContent": "As a boarding school, AIC Sengani Girls High School provides a safe, comfortable, and nurturing environment for our students. Our dormitories are well-maintained and supervised by caring matrons who ensure the well-being of all students.\n\nBoarding life teaches students important life skills such as independence, time management, and interpersonal relationships. It also fosters a strong sense of community and sisterhood among our students, creating bonds that often last a lifetime."
}
